class Info {
  static List<Info> getInfos() => [
        Info(
            "ግብርና ምንድነው?",
            "assets/farming.jpg",
            "ግብርና የአንደኛ ደረጃ ኢኮኖሚያዊ እንቅስቃሴ ነው ፡፡ እሱ ይበልጥ ተስማሚ እንዲሆን በዙሪያው ያለውን አካባቢ ለመለወጥ ዓላማ ያላቸውን ሁሉንም ባህሪዎች ያጠቃልላል ፣ በዚህም ከፍተኛ የአፈር ምርታማነትን ያስገኛል. በተጨማሪም ፣"
                "ለቀጣይ ፍጆታ ወይም ለቀጣይ የኢንዱስትሪ ማቀነባበሪያ የሚሆን ምግብ ያገኛል ፣ ይህም ተጨማሪ እሴት ያስገኛል ፡፡"
                "እርሻ በመጀመሪያ በድንጋይ ዘመን ኒኦሊቲክ ውስጥ የበለፀገ ቢሆንም"
                "ምንም እንኳን መነሻው ከጥንት ጀምሮ የነበረ ቢሆንም ራሱን ችሎ በተለያዩ "
                "ባህሎች የተሻሻለ ነው ፡፡ እስከዚያው ድረስ በአደን ፣ በአሳ ማጥመድ እና በዘላንነት"
                "መልክ በመሰብሰብ ላይ ብቻ የተመሠረተ ኢኮኖሚ ላይ የተመረኮዙ ሰዎች ፡፡"
                "መሬቱን መሥራት ፣ ግብርና ማምረት እና እንደ ስንዴ እና ገብስ ያሉ የመጀመሪያ"
                "ሰብሎቻቸውን ማግኘት ጀመሩ እንዲሁም ዘላን መሆን ሲያቆሙ እንስሳትን እንደ ሌላ መሠረታዊ ነገር መጠቀም ጀመሩ ፡፡ "
                "እንስሳት እንደ እርሻ ፣ በህብረተሰብ ውስጥ ህይወትን ለማቆየት መሰረታዊ የኢኮኖሚ እንቅስቃሴ ነበር ፡፡ "),
        Info(
          "የግብርና ታሪክ አስፈላጊነት",
          "assets/farming_history.jpg",
          "የግብርና ጉዲፈቻ ማለት በእነዚያ በሚያካትቷቸው በእነዚያ ህብረተሰቦች ውስጥ መዋቅራዊ ለውጦች ማለት ነው ፡፡ ይህ የሆነበት ምክንያት የምግብ አቅርቦቱ መጨመር የህዝብ ብዛት እንዲጨምር እና ዝቅተኛ እንቅስቃሴ እንዲዳብር ስለሚያደርግ ነው ፡፡ ህብረተሰቡ ከጊዜ ወደ ጊዜ ውስብስብ እየሆነ ይሄዳል ፣ የሥራ ክፍፍል ይበልጣል እና አብሮ የመኖር አዲስ ህጎች ፡፡ በተጨማሪም የእጅ ጥበብ እና የንግድ እንቅስቃሴዎች የበለጠ እድገት አለ። ይህ ሁሉ ወደ ህብረተሰቦች የበለፀገ ዝግመተ ለውጥ ይተረጎማል. ዋና ዋናዎቹ ከተሞች በምግብ ከተሸፈኑ በኋላ አንድ ህብረተሰብ መበልፀግ እና የበለጠ ውስብስብ እንደሚሆን ያስታውሱ ፡፡"
              "ሆኖም ግብርናው በዘላቂነት የታቀደ መሆን እንዳለበት መታሰብ ይኖርበታል ፡፡ ያለ ልዩነት እና ኃላፊነት የጎደለው እርሻ በአከባቢው ላይ በጣም ከባድ ተጽዕኖ ሊኖረው ይችላል ፡፡ ከቅርብ አሥርተ ዓመታት ወዲህ የተጠናከረ የኢንዱስትሪ ምርት አሳሳቢ ጭማሪ ታይቷል ፡፡ ይህ ሁሉ ወደ ተለያዩ ኬሚካሎች እና ማዳበሪያዎች ጠንካራ አጠቃቀም ይተረጎማል የተፈጥሮን የእድገት ሂደት እና በሸማቾች ጤና ላይ የሚያሳድረውን ተጽዕኖ ያሻሽላል. ከፍተኛ የምግብ ፍላጎት እና አቅርቦትን የማረጋገጥ ግዴታን ከግምት ውስጥ በማስገባት የዘረመል ምህንድስና የእፅዋትን እድገት ለማመቻቸት የተለያዩ መንገዶችን ለማዳበር ተገዷል ፡፡"
              "በሳይንሳዊ ንድፈ ሀሳብ እና በተፈጥሮ ምርጫ እነዚህ የተሻሉ ጂኖችን የሚያዳብሩ ናሙናዎች ሁሉንም ድሎች ለማመቻቸት ተመርጠዋል ፡፡ እነዚያ ዝርያዎች የተሻሉ የኦርጋኖፕቲክ ባህሪዎች ያላቸው እና የተመረጡ በመሆናቸው ባህሎቹ ይበልጥ ዘመናዊ እየሆኑ መጥተዋል እነሱ ለአካባቢያዊ አካባቢያዊ ሁኔታዎችም ሆነ ለተባይ እና ለበሽታዎች የበለጠ የመቋቋም ችሎታ አላቸው በግብርና ውስጥ የተለመደ. ስለሆነም በሱፐር ማርኬቶች ውስጥ በጣም ጥሩ ቀለሞች እና የማይታመን ጥራት ያላቸው የተለያዩ የፍራፍሬ እና የአትክልት ዓይነቶች ማየት እንችላለን ፡፡ በእነዚህ ሁሉ ላይ የማዳበሪያ ፣ የአረም ማጥፊያ ፣ ፀረ-ተባዮች ፣ ወዘተ. እድገትን የበለጠ ለማመቻቸት የትኛው ይረዳል። ለምሳሌ የቲማቲም ዝርያ በሚተክሉበት ጊዜ ለምሳሌ በኢንዱስትሪ ያልታከመ ፣ የበለጠ “ተፈጥሯዊ” ምርት ስለሆነ ጥራቱ አንድ አይነት አለመሆኑን ማየት ይችላሉ ፡፡ ",
        ),
        Info(
            "አይነቶች",
            "assets/farming_types.jpg",
            " በተክሎች ምርቶች ላይ በመመርኮዝ ከፍተኛ መጠን ያላቸው ምግቦችን ለማምረት የኢንዱስትሪ ግብርና እንደ ዋና ዓላማው እናውቃለን ፡፡ ሆኖም ግን በባህሪያቱ ፣ በመጨረሻው ዓላማ እና በእያንዳንዳቸው አመጣጥ ላይ በመመርኮዝ ብዙ የግብርና ዓይነቶች አሉ ፡፡ የተለያዩ የግብርና ዓይነቶች ምን እንደሆኑ እና ዋና ዋና ባህሪያቶቻቸውን እናያለን ፡፡ በአንዳንድ ባህሪዎች ላይ ተመስርተው ይከፈላሉ ፡፡ የመጀመሪያዎቹ ክንውኖች በሚፈጥሩት የምርት መጠን ላይ የተመሰረቱ ይሆናሉ-"
                "የኑሮ እርሻ የዚህ ግብርና ዋና ዓላማ ዝቅተኛ የምርት ደረጃን ጠብቆ ማቆየት ነው ፡፡ ብቸኛው ዓላማ የተረጋጋ ማህበረሰብ መመገብ ሲሆን የሰዎችን ቁጥር ይቀንሰዋል ፡፡ እንዲህ ዓይነቱ ዝቅተኛ ምርት እንደመሆኑ መጠን ብዙውን ጊዜ ከፍተኛ የአፈርን ልብስ አያስከትልም ፡፡"
                "የኢንዱስትሪ እርሻ: - ከአፈር ውስጥ ከፍተኛ መጠን ያለው ምግብ ማምረት ያካተተ ነው። በእነዚያ በኢንዱስትሪ የበለፀጉና ያደጉ አገራት ዓይነተኛ ነው ፣ የሰው ፍላጎቶችን እርካታ ከማረጋገጡም በላይ የተረፈውን በንግድ ወደ ሌሎች አገሮች ለመላክ ያቀዱ ፡፡"
                "ሌሎች የግብርና ዓይነቶች በምርት ሂደት ውስጥ የውሃ አስፈላጊነት ላይ የተመሰረቱ ናቸው ፡፡ እነዚህ የሚከተሉት ናቸው"
                "መስኖ የመስኖ ስርዓት ስላለው ለመስኖ የተለያዩ ተፈጥሮአዊ እና ሰው ሰራሽ ዘዴዎችን ስለሚጠቀም መሰረታዊ የግብርና ዓይነት ነው ፡፡ እዚህ ያሉት ሁሉም ዝርያዎች ቀጣይ ውሃ ያስፈልጋቸዋል ፡፡ በጣም የታወቁ የመስኖ መስኖዎች አንዱ የተንጠባጠብ መስኖ ነው ፡፡"
                "የዝናብ ምግብ እዚህ በሰው ሰራሽ ውሃ ማጠጣት አስፈላጊ አይደለም ፣ ግን ለምርት አስፈላጊው እርጥበት በዝናብ ይሰጣል። አርሶ አደሩ ጣልቃ መግባት አያስፈልገውም ፡፡"
                "ሌሎች የግብርና ዓይነቶች ጥቅም ላይ በሚውሉት የማምረቻ ዘዴዎች እና አፈፃፀማቸው ላይ ተመስርተው የሚከተሉት ናቸው ፡፡"
                "ሰፊ እርሻሰፋፊ እርሻ ዓላማው ያን ያህል ኢኮኖሚያዊ አፈፃፀም ሳይሆን የአፈሩ እንክብካቤ ነው ፡፡ ምክንያቱም ሰፋፊ የአፈር መሸርሸር አካባቢዎች ጥቅም ላይ የሚውሉ እና አነስተኛ የምርት ደረጃ ያላቸው በመሆናቸው ነው ፡፡ ሰፊው ግብርና ዋነኛው ጠቀሜታው መሬቶቹ ያልተጎዱ መሆናቸው እና ያን ያህል ከፍተኛ ተጽዕኖ የማያሳድር መሆኑ ነው ፡፡"
                "የተጠናከረ እርሻዋናው ዓላማው በመሬት ላይ በሚገኝ አነስተኛ ቦታ ላይ ምግብ በብዛት ማምረት ነው ፡፡ ይህ ዓይነቱ ባህል የአፈርን ጥራት እየለበሰ እና ለምነቱን እንዲያጣ ስለሚያደርግ አካባቢን የሚጎዳ ነው ፡፡ በአጠቃላይ እጅግ በጣም በኢንዱስትሪ በበለጸጉ አገራት ሁሉ ጥቅም ላይ ይውላል ፡፡"
                "በመጨረሻም በዋና ዓላማው ጥቅም ላይ በሚውለው ዘዴ ላይ በመመስረት ሌሎች የግብርና ዓይነቶች አሉ"
                "የኢንዱስትሪይህ የምርት ዓይነት በአገር ውስጥ ለገበያ ማቅረብ እና የተትረፈረፈ ምርቶችን ወደ ውጭ ለመላክ የሚያስችል ከፍተኛ መጠን ያለው ምግብ ለማግኘት ያለመ ነው ፡፡"
                "ሥነ ምህዳራዊ እርሻ ቅድሚያ የሚሰጠው ጉዳይ አካባቢን መለወጥ እና ተጽዕኖዎችን ለመቀነስ አይደለም ፡፡ የአፈሩ እንክብካቤ ቅድሚያ የሚሰጠው መሆን አለበት እና ለዚህም ተገቢ ዘዴዎች እና ቴክኖሎጂዎች ጥቅም ላይ ይውላሉ ፡፡"
                "ባህላዊ እርሻ እሱ በዋነኝነት የሚጠቀሰው የአንድ ክልል ተወላጅ ቴክኒኮችን እና አሠራሮችን በመጠቀም ነው ፡፡ በቦታው ባህል ምስጋና እነዚህ ሁሉ ቴክኒኮች ከትውልድ ወደ ትውልድ ይተላለፋሉ ፡፡"
                "በዚህ መረጃ ግብርና ምን እንደ ሆነ እና ባህሪያቱ የበለጠ ማወቅ እንደሚችሉ ተስፋ አደርጋለሁ ፡፡ "),
        Info(
          "ዘር",
          "assets/seed.jpg",
          "ዘሮች ለሰው ልጅ ምግብ ዋና መሠረት ናቸው። ከጊዜ በኋላ በተከታታይ መሻሻል እና መመረጥ ምክንያት የሰብል ዝርያዎችን እና የእነሱን ዝርያዎች የዘረመል አቅም ማከማቻ ናቸው።"
              "የተሻሻለ የሰብል ምርትን ለማረጋገጥ እና እያደጉ ያሉ አካባቢያዊ ተግዳሮቶችን ለማሟላት የሰብል ማሻሻያ እና ከፍተኛ ጥራት ያላቸው ዘሮችን እና የተመረጡ ዝርያዎችን የመትከል ቁሳቁሶችን ለአርሶ አደሮች ማድረስ አስፈላጊ ነው። ስለዚህ የምግብ ዋስትና በግብርና ማህበረሰቦች የዘር ደህንነት ላይ ጥገኛ ነው።",
        ),
        Info(
          "የአትክልት እርሻ",
          "assets/vegetables.jpg",
          "የአትክልት እርሻ ፣ የአትክልት እርሻ ቅርንጫፍ ከአትክልት ሰብሎች ጋር ፣ በአጠቃላይ ፍራፍሬዎች ፣ አትክልቶች እና የጌጣጌጥ እፅዋት። ቃሉ የመጣው ከላቲን ሆርቱስ ፣ “የአትክልት ስፍራ ፣” እና ኮሌሬር ፣ “ለማልማት” ነው። እንደ አጠቃላይ ቃል ፣ ሁሉንም የአትክልትን አያያዝ ዓይነቶች ይሸፍናል ፣ ግን በመደበኛ አጠቃቀም እሱ ጥልቅ የንግድ ሥራን ያመለክታል። በመጠን አንፃር ፣ የአትክልት እርሻ በአገር ውስጥ የአትክልት እና በመስክ እርሻ መካከል ይወድቃል ፣ ምንም እንኳን ሁሉም የእርሻ ዓይነቶች በተፈጥሮ ቅርብ ግንኙነቶች አሏቸው።",
        ),
        Info(
          "የእንስሳት እርባታ",
          "assets/livestock.jpg",
          "የእንስሳት እርባታ በተለምዶ እንደ ሥጋ ፣ እንቁላል ፣ ወተት ፣ ሱፍ ፣ ቆዳ እና ሱፍ ያሉ የጉልበት እና ሸቀጣ ሸቀጦችን ለማምረት በግብርና አከባቢ ውስጥ ያደጉ የቤት እንስሳት ናቸው። ቃሉ አንዳንድ ጊዜ ለምግብነት የሚራቡትን ብቻ ለማመልከት የሚያገለግል ሲሆን በሌላ ጊዜ ደግሞ የእርሻ እርባታዎችን ማለትም ከብቶችን ፣ በግን እና ፍየሎችን ብቻ ያመለክታል። በአሜሪካ ውስጥ ፈረሶች እንደ ከብት ይቆጠራሉ። USDA የአሳማ ሥጋ ፣ የጥጃ ሥጋ ፣ የበሬ እና የበግ (የበግ ሥጋ) እንደ ከብት እንዲሁም ሁሉንም ከብቶች እንደ ቀይ ሥጋ ይመድባል። የዶሮ እርባታ እና ዓሳ በምድቡ ውስጥ አይካተቱም።",
        ),
      ];
  String title;
  String description;
  String images;
  //List<String> images;
  Info(
    this.title,
    this.images,
    this.description,
  );
}
